# =====================================
# 数据文件
# =====================================

FILE_PATHS = [
    f'./2.asc/DN9718N12K071-2-tran-3-{i:05d}'
    for i in range(7700, 8271, 10)
]


# =====================================
# ConvLSTM 参数
# =====================================

INPUT_STEPS = 8

HIDDEN_DIMS = [64, 128]   # 双层 ConvLSTM

KERNEL_SIZE = 3


# =====================================
# 网格参数
# =====================================

GRID_SIZE = (64, 64)


# =====================================
# 数据集划分
# =====================================

TRAIN_RATIO = 0.8


# =====================================
# 训练参数
# =====================================

BATCH_SIZE = 16            # RTX 5060 Ti 16GB

EPOCHS = 120

LR = 1e-3

GRAD_CLIP = 1.0             # 梯度裁剪


# =====================================
# 损失权重
# =====================================

LAMBDA_BOUNDARY = 0.2      # 边界加权 MSE 系数

LAMBDA_GRADIENT = 0.01   # 梯度损失系数


# =====================================
# 学习率调度
# =====================================

T_0 = 20                    # CosineAnnealingWarmRestarts 初始周期

T_MULT = 2                  # 每轮周期倍增因子


# =====================================
# 保存路径
# =====================================

MODEL_SAVE_PATH = "convlstm_flow_model2.pth"

# 可视化输出
RESULT_FIG_PATH = "convlstm_training_results.png"
FLOW_FIELD_FIG_PATH = "convlstm_flow_field.png"
